app/Http/Controllers/Auth/RegisteredUserController.php

    public function create(): View
    {
        $accountTypes = \App\Models\AccountType::where('is_active',1)->get();
---
select * from `account_types` where `is_active` = 1

    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:'.User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
            'account_type' => ['required'],
            'h-captcha-response' => ['hcaptcha'],
        ],[
        'h-captcha-response.hcaptcha' => 'The CAPTCHA verification failed. Please verify that you are human.',
    ]);


        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
            'account_type_id' => $request->account_type,
            'user_type' => 'Member',
        ]);

        $notification = new \App\Models\MemberReminder;
        $notification->title = "A new user has signed up to IPPU";
        $notification->member_id = $user->id;
        $notification->reminder_date = date('Y-m-d');
        $notification->status = "Unread";
        $notification->save();
---
insert into `users` (`name`, `email`, `password`, `account_type_id`, `user_type`, `updated_at`, `created_at`) values ('dave', 'ochwodavid0311@gmail.com', '$2y$10$TwxnkrGqH7MOyQbScTQDA.UnToGtHsyHq/X7ykQnscfdFN47/I.MW', '1', 'Member', '2024-06-04 14:48:50', '2024-06-04 14:48:50')
insert into `member_reminders` (`title`, `member_id`, `reminder_date`, `status`, `updated_at`, `created_at`) values ('A new user has signed up to IPPU', 2, '2024-06-04', 'Unread', '2024-06-04 14:48:50', '2024-06-04 14:48:50')