app/Http/Controllers/CpdsController.php

    public function index()
    {
        $cpds = Cpd::all();
---
select * from `cpds`