app/Http/Controllers/DashboardController.php

    public function index()
    {
        if (Auth::user()->user_type == "Admin") {
            $account_types = AccountType::withCount('users')->get();

            $users_chart_series = "[";
            $users_chart_labels = "[";

            foreach ($account_types as $account_type) {
                $users_chart_series .= $account_type->users_count.',';
                $users_chart_labels .= '"'.$account_type->name.'",';
            }

            $invoices = \App\Models\Invoice::take(5)->orderBy('id','desc')->get();

            $invoices_count = \App\Models\Invoice::count();
            $members_count = \App\Models\User::where('user_type','Member')->count();
            $cpds_count = \App\Models\Cpd::count();
            $events_count = \App\Models\Event::count();
---
select * from `invoices` order by `id` desc limit 5
select count(*) as aggregate from `invoices`
select count(*) as aggregate from `users` where `user_type` = 'Member'
select count(*) as aggregate from `cpds`
select count(*) as aggregate from `events`